AlmAck/svdtonuttx/demo/h/da1470x_usb.h
/****************************************************************************
 * ./tmp/da1470x_usb.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_USB_H
#define __DA1470X_USB_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_USB_USB_ALTEV_OFFSET          0x0020 /* Alternate Event Register */
#define DA1470X_USB_USB_ALTMSK_OFFSET         0x0024 /* Alternate Mask Register */
#define DA1470X_USB_USB_CHARGER_STAT_OFFSET   0x01AC /* USB Charger Status Register */
#define DA1470X_USB_USB_DMA_CTRL_OFFSET       0x01A0 /* USB DMA control register */
#define DA1470X_USB_USB_EP0_NAK_OFFSET        0x0090 /* EP0 INNAK and OUTNAK Register */
#define DA1470X_USB_USB_EPC0_OFFSET           0x0080 /* Endpoint Control 0 Register */
#define DA1470X_USB_USB_EPC1_OFFSET           0x00A0 /* Endpoint Control Register 1 */
#define DA1470X_USB_USB_EPC2_OFFSET           0x00B0 /* Endpoint Control Register 2 */
#define DA1470X_USB_USB_EPC3_OFFSET           0x00C0 /* Endpoint Control Register 3 */
#define DA1470X_USB_USB_EPC4_OFFSET           0x00D0 /* Endpoint Control Register 4 */
#define DA1470X_USB_USB_EPC5_OFFSET           0x00E0 /* Endpoint Control Register 5 */
#define DA1470X_USB_USB_EPC6_OFFSET           0x00F0 /* Endpoint Control Register 6 */
#define DA1470X_USB_USB_FAR_OFFSET            0x0010 /* Function Address Register */
#define DA1470X_USB_USB_FNH_OFFSET            0x0048 /* Frame Number High Byte Register */
#define DA1470X_USB_USB_FNL_OFFSET            0x004C /* Frame Number Low Byte Register */
#define DA1470X_USB_USB_FWEV_OFFSET           0x0040 /* FIFO Warning Event Register */
#define DA1470X_USB_USB_FWMSK_OFFSET          0x0044 /* FIFO Warning Mask Register */
#define DA1470X_USB_USB_MAEV_OFFSET           0x0018 /* Main Event Register */
#define DA1470X_USB_USB_MAMSK_OFFSET          0x001C /* Main Mask Register */
#define DA1470X_USB_USB_MCTRL_OFFSET          0x0000 /* Main Control Register) */
#define DA1470X_USB_USB_NAKEV_OFFSET          0x0038 /* NAK Event Register */
#define DA1470X_USB_USB_NAKMSK_OFFSET         0x003C /* NAK Mask Register */
#define DA1470X_USB_USB_NFSR_OFFSET           0x0014 /* Node Functional State Register */
#define DA1470X_USB_USB_RXC0_OFFSET           0x009C /* Receive Command 0 Register */
#define DA1470X_USB_USB_RXC1_OFFSET           0x00BC /* Receive Command Register 1 */
#define DA1470X_USB_USB_RXC2_OFFSET           0x00DC /* Receive Command Register 2 */
#define DA1470X_USB_USB_RXC3_OFFSET           0x00FC /* Receive Command Register 3 */
#define DA1470X_USB_USB_RXD0_OFFSET           0x0094 /* Receive Data 0 Register */
#define DA1470X_USB_USB_RXD1_OFFSET           0x00B4 /* Receive Data Register,1 */
#define DA1470X_USB_USB_RXD2_OFFSET           0x00D4 /* Receive Data Register 2 */
#define DA1470X_USB_USB_RXD3_OFFSET           0x00F4 /* Receive Data Register 3 */
#define DA1470X_USB_USB_RXEV_OFFSET           0x0030 /* Receive Event Register */
#define DA1470X_USB_USB_RXMSK_OFFSET          0x0034 /* Receive Mask Register */
#define DA1470X_USB_USB_RXS0_OFFSET           0x0098 /* Receive Status 0 Register */
#define DA1470X_USB_USB_RXS1_OFFSET           0x00B8 /* Receive Status Register 1 */
#define DA1470X_USB_USB_RXS2_OFFSET           0x00D8 /* Receive Status Register 2 */
#define DA1470X_USB_USB_RXS3_OFFSET           0x00F8 /* Receive Status Register 3 */
#define DA1470X_USB_USB_TCR_OFFSET            0x0008 /* Transceiver configuration Register */
#define DA1470X_USB_USB_TXC0_OFFSET           0x008C /* Transmit command 0 Register */
#define DA1470X_USB_USB_TXC1_OFFSET           0x00AC /* Transmit Command Register 1 */
#define DA1470X_USB_USB_TXC2_OFFSET           0x00CC /* Transmit Command Register 2 */
#define DA1470X_USB_USB_TXC3_OFFSET           0x00EC /* Transmit Command Register 3 */
#define DA1470X_USB_USB_TXD0_OFFSET           0x0084 /* Transmit Data 0 Register */
#define DA1470X_USB_USB_TXD1_OFFSET           0x00A4 /* Transmit Data Register 1 */
#define DA1470X_USB_USB_TXD2_OFFSET           0x00C4 /* Transmit Data Register 2 */
#define DA1470X_USB_USB_TXD3_OFFSET           0x00E4 /* Transmit Data Register 3 */
#define DA1470X_USB_USB_TXEV_OFFSET           0x0028 /* Transmit Event Register */
#define DA1470X_USB_USB_TXMSK_OFFSET          0x002C /* Transmit Mask Register */
#define DA1470X_USB_USB_TXS0_OFFSET           0x0088 /* Transmit Status 0 Register */
#define DA1470X_USB_USB_TXS1_OFFSET           0x00A8 /* Transmit Status Register 1 */
#define DA1470X_USB_USB_TXS2_OFFSET           0x00C8 /* Transmit Status Register 2 */
#define DA1470X_USB_USB_TXS3_OFFSET           0x00E8 /* Transmit Status Register 3 */
#define DA1470X_USB_USB_UTR_OFFSET            0x000C /* USB test Register (for test purpose only) */
#define DA1470X_USB_USB_UX20CDR_OFFSET        0x007C /* Transceiver 2.0 Configuration and Diagnostics Register(for test purpose only) */
#define DA1470X_USB_USB_XCVDIAG_OFFSET        0x0004 /* Transceiver diagnostic Register (for test purpose only) */

