AlmAck/svdtonuttx/demo/h/da1470x_usb.h
/* Register addresses *******************************************************/

#define DA1470X_USB_BASE                      0x51000000 /* USB registers */

#define DA1470X_USB_USB_ALTEV                 (DA1470X_USB_BASE + DA1470X_USB_USB_ALTEV_OFFSET) /* Alternate Event Register */
#define DA1470X_USB_USB_ALTMSK                (DA1470X_USB_BASE + DA1470X_USB_USB_ALTMSK_OFFSET) /* Alternate Mask Register */
#define DA1470X_USB_USB_CHARGER_STAT          (DA1470X_USB_BASE + DA1470X_USB_USB_CHARGER_STAT_OFFSET) /* USB Charger Status Register */
#define DA1470X_USB_USB_DMA_CTRL              (DA1470X_USB_BASE + DA1470X_USB_USB_DMA_CTRL_OFFSET) /* USB DMA control register */
#define DA1470X_USB_USB_EP0_NAK               (DA1470X_USB_BASE + DA1470X_USB_USB_EP0_NAK_OFFSET) /* EP0 INNAK and OUTNAK Register */
#define DA1470X_USB_USB_EPC0                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC0_OFFSET) /* Endpoint Control 0 Register */
#define DA1470X_USB_USB_EPC1                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC1_OFFSET) /* Endpoint Control Register 1 */
#define DA1470X_USB_USB_EPC2                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC2_OFFSET) /* Endpoint Control Register 2 */
#define DA1470X_USB_USB_EPC3                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC3_OFFSET) /* Endpoint Control Register 3 */
#define DA1470X_USB_USB_EPC4                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC4_OFFSET) /* Endpoint Control Register 4 */
#define DA1470X_USB_USB_EPC5                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC5_OFFSET) /* Endpoint Control Register 5 */
#define DA1470X_USB_USB_EPC6                  (DA1470X_USB_BASE + DA1470X_USB_USB_EPC6_OFFSET) /* Endpoint Control Register 6 */
#define DA1470X_USB_USB_FAR                   (DA1470X_USB_BASE + DA1470X_USB_USB_FAR_OFFSET) /* Function Address Register */
#define DA1470X_USB_USB_FNH                   (DA1470X_USB_BASE + DA1470X_USB_USB_FNH_OFFSET) /* Frame Number High Byte Register */
#define DA1470X_USB_USB_FNL                   (DA1470X_USB_BASE + DA1470X_USB_USB_FNL_OFFSET) /* Frame Number Low Byte Register */
#define DA1470X_USB_USB_FWEV                  (DA1470X_USB_BASE + DA1470X_USB_USB_FWEV_OFFSET) /* FIFO Warning Event Register */
#define DA1470X_USB_USB_FWMSK                 (DA1470X_USB_BASE + DA1470X_USB_USB_FWMSK_OFFSET) /* FIFO Warning Mask Register */
#define DA1470X_USB_USB_MAEV                  (DA1470X_USB_BASE + DA1470X_USB_USB_MAEV_OFFSET) /* Main Event Register */
#define DA1470X_USB_USB_MAMSK                 (DA1470X_USB_BASE + DA1470X_USB_USB_MAMSK_OFFSET) /* Main Mask Register */
#define DA1470X_USB_USB_MCTRL                 (DA1470X_USB_BASE + DA1470X_USB_USB_MCTRL_OFFSET) /* Main Control Register) */
#define DA1470X_USB_USB_NAKEV                 (DA1470X_USB_BASE + DA1470X_USB_USB_NAKEV_OFFSET) /* NAK Event Register */
#define DA1470X_USB_USB_NAKMSK                (DA1470X_USB_BASE + DA1470X_USB_USB_NAKMSK_OFFSET) /* NAK Mask Register */
#define DA1470X_USB_USB_NFSR                  (DA1470X_USB_BASE + DA1470X_USB_USB_NFSR_OFFSET) /* Node Functional State Register */
#define DA1470X_USB_USB_RXC0                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXC0_OFFSET) /* Receive Command 0 Register */
#define DA1470X_USB_USB_RXC1                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXC1_OFFSET) /* Receive Command Register 1 */
#define DA1470X_USB_USB_RXC2                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXC2_OFFSET) /* Receive Command Register 2 */
#define DA1470X_USB_USB_RXC3                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXC3_OFFSET) /* Receive Command Register 3 */
#define DA1470X_USB_USB_RXD0                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXD0_OFFSET) /* Receive Data 0 Register */
#define DA1470X_USB_USB_RXD1                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXD1_OFFSET) /* Receive Data Register,1 */
#define DA1470X_USB_USB_RXD2                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXD2_OFFSET) /* Receive Data Register 2 */
#define DA1470X_USB_USB_RXD3                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXD3_OFFSET) /* Receive Data Register 3 */
#define DA1470X_USB_USB_RXEV                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXEV_OFFSET) /* Receive Event Register */
#define DA1470X_USB_USB_RXMSK                 (DA1470X_USB_BASE + DA1470X_USB_USB_RXMSK_OFFSET) /* Receive Mask Register */
#define DA1470X_USB_USB_RXS0                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXS0_OFFSET) /* Receive Status 0 Register */
#define DA1470X_USB_USB_RXS1                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXS1_OFFSET) /* Receive Status Register 1 */
#define DA1470X_USB_USB_RXS2                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXS2_OFFSET) /* Receive Status Register 2 */
#define DA1470X_USB_USB_RXS3                  (DA1470X_USB_BASE + DA1470X_USB_USB_RXS3_OFFSET) /* Receive Status Register 3 */
#define DA1470X_USB_USB_TCR                   (DA1470X_USB_BASE + DA1470X_USB_USB_TCR_OFFSET) /* Transceiver configuration Register */
#define DA1470X_USB_USB_TXC0                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXC0_OFFSET) /* Transmit command 0 Register */
#define DA1470X_USB_USB_TXC1                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXC1_OFFSET) /* Transmit Command Register 1 */
#define DA1470X_USB_USB_TXC2                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXC2_OFFSET) /* Transmit Command Register 2 */
#define DA1470X_USB_USB_TXC3                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXC3_OFFSET) /* Transmit Command Register 3 */
#define DA1470X_USB_USB_TXD0                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXD0_OFFSET) /* Transmit Data 0 Register */
#define DA1470X_USB_USB_TXD1                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXD1_OFFSET) /* Transmit Data Register 1 */
#define DA1470X_USB_USB_TXD2                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXD2_OFFSET) /* Transmit Data Register 2 */
#define DA1470X_USB_USB_TXD3                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXD3_OFFSET) /* Transmit Data Register 3 */
#define DA1470X_USB_USB_TXEV                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXEV_OFFSET) /* Transmit Event Register */
#define DA1470X_USB_USB_TXMSK                 (DA1470X_USB_BASE + DA1470X_USB_USB_TXMSK_OFFSET) /* Transmit Mask Register */
#define DA1470X_USB_USB_TXS0                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXS0_OFFSET) /* Transmit Status 0 Register */
#define DA1470X_USB_USB_TXS1                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXS1_OFFSET) /* Transmit Status Register 1 */
#define DA1470X_USB_USB_TXS2                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXS2_OFFSET) /* Transmit Status Register 2 */
#define DA1470X_USB_USB_TXS3                  (DA1470X_USB_BASE + DA1470X_USB_USB_TXS3_OFFSET) /* Transmit Status Register 3 */
#define DA1470X_USB_USB_UTR                   (DA1470X_USB_BASE + DA1470X_USB_USB_UTR_OFFSET) /* USB test Register (for test purpose only) */
#define DA1470X_USB_USB_UX20CDR               (DA1470X_USB_BASE + DA1470X_USB_USB_UX20CDR_OFFSET) /* Transceiver 2.0 Configuration and Diagnostics Register(for test purpose only) */
#define DA1470X_USB_USB_XCVDIAG               (DA1470X_USB_BASE + DA1470X_USB_USB_XCVDIAG_OFFSET) /* Transceiver diagnostic Register (for test purpose only) */

/* Register bit definitions *************************************************/


/* USB_ALTEV Register */

#define USB_USB_RESUME                        (1U << 7) /* Resume Resume signalling is detected on the USB when the device is in Suspend st */
#define USB_USB_RESET                         (1U << 6) /* Reset This bit is set to 1, when 2.5 ms of SEO have been detected on the upstrea */
#define USB_USB_SD5                           (1U << 5) /* Suspend Detect 5 ms This bit is set to 1 after 5 ms of IDLE have been detected o */
#define USB_USB_SD3                           (1U << 4) /* Suspend Detect 3 ms This bit is set to 1 after 3 ms of IDLE have been detected o */
#define USB_USB_EOP                           (1U << 3) /* End of Packet A valid EOP sequence was been detected on the USB. It is used when */

/* USB_ALTMSK Register */

#define USB_USB_M_RESUME                      (1U << 7) /* A bit set to 1 in this register enables automatic setting of the ALT bit in the  */
#define USB_USB_M_RESET                       (1U << 6) /* Same Bit Definition as ALTEV Register */
#define USB_USB_M_SD5                         (1U << 5) /* Same Bit Definition as ALTEV Register */
#define USB_USB_M_SD3                         (1U << 4) /* Same Bit Definition as ALTEV Register */
#define USB_USB_M_EOP                         (1U << 3) /* Same Bit Definition as ALTEV Register */

/* USB_CHARGER_STAT Register */

#define USB_USB_DM_VAL2                       (1U << 5) /* 0: USBm < 2.3 V 1: USBm > 2.5 V */
#define USB_USB_DP_VAL2                       (1U << 4) /* 0: USBp < 2.3 V 1: USBp > 2.5 V */
#define USB_USB_DM_VAL                        (1U << 3) /* 0: USBm < 0.8 V 1: USBm > 1.5 V (PS2 or Proprietary Charger) */
#define USB_USB_DP_VAL                        (1U << 2) /* 0: USBp < 0.8 V 1: USBp > 1.5 V */
#define USB_USB_CHG_DET                       (1U << 1) /* 0: Standard downstream or nothing connected. 1: Charging Downstream Port (CDP) o */
#define USB_USB_DCP_DET                       (1U << 0) /* 0: Charging downstream port is detected. 1: Dedicated charger is detected. Contr */

