AlmAck/svdtonuttx/demo/h/da1470x_usb.h
/* USB_DMA_CTRL Register */

#define USB_USB_DMA_EN                        (1U << 6) /* 0 = USB DMA control off. (Normal operation) 1 = USB_DMA on. DMA channels 0 and 1 */
#define USB_USB_DMA_TX_MASK                   (0x7 << 3) /* 000 = DMA channels 1 is connected Tx USB Endpoint 1 001 = DMA channels 1 is conn */
#define USB_USB_DMA_TX_POS                    (3) /* 000 = DMA channels 1 is connected Tx USB Endpoint 1 001 = DMA channels 1 is conn */
#define USB_USB_DMA_RX_MASK                   (0x7 << 0) /* 000 = DMA channels 0 is connected Rx USB Endpoint 2 001 = DMA channels 0 is conn */
#define USB_USB_DMA_RX_POS                    (0) /* 000 = DMA channels 0 is connected Rx USB Endpoint 2 001 = DMA channels 0 is conn */

/* USB_EP0_NAK Register */

#define USB_USB_EP0_OUTNAK                    (1U << 1) /* End point 0 OUT NAK This bit n is set to 1 when a NAK handshake is generated for */
#define USB_USB_EP0_INNAK                     (1U << 0) /* End point 0 IN NAK This bit is set to 1 when a NAK handshake is generated for an */

/* USB_EPC0 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_DEF                           (1U << 6) /* Default Address When set to 1, the device responds to the default address regard */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This field holds the 4-bit Endpoint address. For Endpoint 0, th */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This field holds the 4-bit Endpoint address. For Endpoint 0, th */

/* USB_EPC1 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_EPC2 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_EPC3 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_EPC4 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_EPC5 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_EPC6 Register */

#define USB_USB_STALL                         (1U << 7) /* Stall Setting this bit to 1 causes the chip to generate STALL handshakes under t */
#define USB_USB_ISO                           (1U << 5) /* Isochronous When this bit is set to 1, the endpoint is isochronous. This implies */
#define USB_USB_EP_EN                         (1U << 4) /* Endpoint Enable When this bit is set to 1, the EP[3:0] field is used in address  */
#define USB_USB_EP_MASK                       (0xF << 0) /* Endpoint Address This 4-bit field holds the endpoint address. */
#define USB_USB_EP_POS                        (0) /* Endpoint Address This 4-bit field holds the endpoint address. */

/* USB_FAR Register */

#define USB_USB_AD_EN                         (1U << 7) /* Address Enable When set to 1, USB address field bits 6-0 are used in address com */
#define USB_USB_AD_MASK                       (0x7F << 0) /* Address This field holds the 7-bit function address used to transmit and receive */
#define USB_USB_AD_POS                        (0) /* Address This field holds the 7-bit function address used to transmit and receive */

/* USB_FNH Register */

