AlmAck/svdtonuttx/demo/h/da1470x_usb.h
#define USB_USB_MF                            (1U << 7) /* Missed SOF Flag This flag is set to 1, when the frame number in a valid received */
#define USB_USB_UL                            (1U << 6) /* Unlock Flag This bit indicates that at least two frames were received without an */
#define USB_USB_RFC                           (1U << 5) /* Reset Frame Count Writing a 1 to this bit resets the frame number to 00016, afte */
#define USB_USB_FN_10_8_MASK                  (0x7 << 0) /* Frame Number This 3-bit field contains the three most significant bits (MSB) of  */
#define USB_USB_FN_10_8_POS                   (0) /* Frame Number This 3-bit field contains the three most significant bits (MSB) of  */

/* USB_FNL Register */

#define USB_USB_FN_MASK                       (0xFF << 0) /* The Frame Number Low Byte Register holds the low byte of the frame number. To en */
#define USB_USB_FN_POS                        (0) /* The Frame Number Low Byte Register holds the low byte of the frame number. To en */

/* USB_FWEV Register */

#define USB_USB_RXWARN31_MASK                 (0x7 << 4) /* Receive Warning n: 3:1 The bit n is set to 1 when the respective receive endpoin */
#define USB_USB_RXWARN31_POS                  (4) /* Receive Warning n: 3:1 The bit n is set to 1 when the respective receive endpoin */
#define USB_USB_TXWARN31_MASK                 (0x7 << 0) /* Transmit Warning n: 3:1 The bit n is set to 1 when the respective transmit endpo */
#define USB_USB_TXWARN31_POS                  (0) /* Transmit Warning n: 3:1 The bit n is set to 1 when the respective transmit endpo */

/* USB_FWMSK Register */

#define USB_USB_M_RXWARN31_MASK               (0x7 << 4) /* The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV */
#define USB_USB_M_RXWARN31_POS                (4) /* The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV */
#define USB_USB_M_TXWARN31_MASK               (0x7 << 0) /* The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV */
#define USB_USB_M_TXWARN31_POS                (0) /* The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV */

/* USB_MAEV Register */

#define USB_USB_CH_EV                         (1U << 11) /* USB Charger event This bit is set if one of the bits in USB_CHARGER_STAT_REG[2-0 */
#define USB_USB_EP0_NAK                       (1U << 10) /* Endpoint 0 NAK Event This bit is an OR of EP0_NAK_REG[EP0_OUTNAK] and EP0_NAK_RE */
#define USB_USB_EP0_RX                        (1U << 9) /* Endpoint 0 Receive Event This bit is a copy of the RXS0[RX_LAST] and is cleared  */
#define USB_USB_EP0_TX                        (1U << 8) /* Endpoint 0 Transmit Event This bit is a copy of the TXS0[TX_DONE] bit and is cle */
#define USB_USB_INTR                          (1U << 7) /* Master Interrupt Enable This bit is hardwired to 0 in the Main Event (MAEV) regi */
#define USB_USB_RX_EV                         (1U << 6) /* Receive Event This bit is set to 1 if any of the unmasked bits in the Receive Ev */
#define USB_USB_ULD                           (1U << 5) /* Unlocked/Locked Detected This bit is set to 1, when the frame timer has either e */
#define USB_USB_NAK                           (1U << 4) /* Negative Acknowledge Event This bit indicates that one of the unmasked NAK Event */
#define USB_USB_FRAME                         (1U << 3) /* Frame Event This bit is set to 1, if the frame counter is updated with a new val */
#define USB_USB_TX_EV                         (1U << 2) /* Transmit Event This bit is set to 1, if any of the unmasked bits in the Transmit */
#define USB_USB_ALT                           (1U << 1) /* Alternate Event This bit indicates that one of the unmasked ALTEV register bits  */
#define USB_USB_WARN                          (1U << 0) /* Warning Event This bit indicates that one of the unmasked bits in the FIFO Warni */

/* USB_MAMSK Register */

#define USB_USB_M_CH_EV                       (1U << 11) /* The Main Mask Register masks out events reported in the MAEV registers. A bit se */
#define USB_USB_M_EP0_NAK                     (1U << 10) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_EP0_RX                      (1U << 9) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_EP0_TX                      (1U << 8) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_INTR                        (1U << 7) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_RX_EV                       (1U << 6) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_ULD                         (1U << 5) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_NAK                         (1U << 4) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_FRAME                       (1U << 3) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_TX_EV                       (1U << 2) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_ALT                         (1U << 1) /* Same Bit Definition as MAEV Register */
#define USB_USB_M_WARN                        (1U << 0) /* Same Bit Definition as MAEV Register */

/* USB_MCTRL Register */

#define USB_LSMODE                            (1U << 4) /* Low Speed Mode This bit enables USB 1.5 Mb/s low speed and swaps D+ and D- pull- */
#define USB_USB_NAT                           (1U << 3) /* Node Attached This bit indicates that this node is ready to be detected as attac */
#define USB_USB_DBG                           (1U << 1) /* Debug Mode. When this bit is set, the following registers are writable: Main Eve */
#define USB_USBEN                             (1U << 0) /* USB EnableSetting this bit to 1 enables the Full/Low Speed USB node. If the USBE */

/* USB_NAKEV Register */

#define USB_USB_OUT31_MASK                    (0x7 << 4) /* OUT n: 3:1 The bit n is set to 1 when a NAK handshake is generated for an enable */
#define USB_USB_OUT31_POS                     (4) /* OUT n: 3:1 The bit n is set to 1 when a NAK handshake is generated for an enable */
#define USB_USB_IN31_MASK                     (0x7 << 0) /* IN n: 3:1 The bit n is set to 1 when a NAK handshake is generated for an enabled */
#define USB_USB_IN31_POS                      (0) /* IN n: 3:1 The bit n is set to 1 when a NAK handshake is generated for an enabled */

/* USB_NAKMSK Register */

#define USB_USB_M_OUT31_MASK                  (0x7 << 4) /* When set and the corresponding bit in the NAKEV register is set, the NAK bit in  */
#define USB_USB_M_OUT31_POS                   (4) /* When set and the corresponding bit in the NAKEV register is set, the NAK bit in  */
#define USB_USB_M_IN31_MASK                   (0x7 << 0) /* Same Bit Definition as NAKEV Register */
#define USB_USB_M_IN31_POS                    (0) /* Same Bit Definition as NAKEV Register */

/* USB_NFSR Register */

#define USB_USB_NFS_MASK                      (0x3 << 0) /* The Node Functional State Register reports and controls the current functional s */
#define USB_USB_NFS_POS                       (0) /* The Node Functional State Register reports and controls the current functional s */

/* USB_RXC0 Register */

#define USB_USB_FLUSH                         (1U << 3) /* Flush Writing a 1 to this bit flushes all data from the control endpoint FIFOs,  */
#define USB_USB_IGN_SETUP                     (1U << 2) /* Ignore SETUP Tokens When this bit is set to 1, the endpoint ignores any SETUP to */
#define USB_USB_IGN_OUT                       (1U << 1) /* Ignore OUT Tokens When this bit is set to 1, the endpoint ignores any OUT tokens */
#define USB_USB_RX_EN                         (1U << 0) /* Receive Enable OUT packet reception is disabled after every data packet is recei */

/* USB_RXC1 Register */

