AlmAck/svdtonuttx/demo/h/da1470x_usb.h
#define USB_USB_RFWL_MASK                     (0x3 << 5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_RFWL_POS                      (5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding recei */
#define USB_USB_IGN_SETUP                     (1U << 2) /* Ignore SETUP Tokens When this bit is set to 1, the endpoint ignores any SETUP to */
#define USB_USB_RX_EN                         (1U << 0) /* Receive Enable OUT packet cannot be received after every data packet is received */

/* USB_RXC2 Register */

#define USB_USB_RFWL_MASK                     (0x3 << 5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_RFWL_POS                      (5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding recei */
#define USB_USB_IGN_SETUP                     (1U << 2) /* Ignore SETUP Tokens When this bit is set to 1, the endpoint ignores any SETUP to */
#define USB_USB_RX_EN                         (1U << 0) /* Receive Enable OUT packet cannot be received after every data packet is received */

/* USB_RXC3 Register */

#define USB_USB_RFWL_MASK                     (0x3 << 5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_RFWL_POS                      (5) /* Receive FIFO Warning Limit These bits specify how many more bytes can be receive */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding recei */
#define USB_USB_IGN_SETUP                     (1U << 2) /* Ignore SETUP Tokens When this bit is set to 1, the endpoint ignores any SETUP to */
#define USB_USB_RX_EN                         (1U << 0) /* Receive Enable OUT packet cannot be received after every data packet is received */

/* USB_RXD0 Register */

#define USB_USB_RXFD_MASK                     (0xFF << 0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */
#define USB_USB_RXFD_POS                      (0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */

/* USB_RXD1 Register */

#define USB_USB_RXFD_MASK                     (0xFF << 0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */
#define USB_USB_RXFD_POS                      (0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */

/* USB_RXD2 Register */

#define USB_USB_RXFD_MASK                     (0xFF << 0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */
#define USB_USB_RXFD_POS                      (0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */

/* USB_RXD3 Register */

#define USB_USB_RXFD_MASK                     (0xFF << 0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */
#define USB_USB_RXFD_POS                      (0) /* Receive FIFO Data Byte The firmware should expect to read only the packet payloa */

/* USB_RXEV Register */

#define USB_USB_RXOVRRN31_MASK                (0x7 << 4) /* Receive Overrun n: 3:1 The bit n is set to 1 in the event of an overrun conditio */
#define USB_USB_RXOVRRN31_POS                 (4) /* Receive Overrun n: 3:1 The bit n is set to 1 in the event of an overrun conditio */
#define USB_USB_RXFIFO31_MASK                 (0x7 << 0) /* Receive FIFO n: 3:1 The bit n is set to 1 whenever either RX_ERR or RX_LAST in t */
#define USB_USB_RXFIFO31_POS                  (0) /* Receive FIFO n: 3:1 The bit n is set to 1 whenever either RX_ERR or RX_LAST in t */

/* USB_RXMSK Register */

#define USB_USB_M_RXOVRRN31_MASK              (0x7 << 4) /* The Receive Mask Register is used to select the bits of the RXEV registers, whic */
#define USB_USB_M_RXOVRRN31_POS               (4) /* The Receive Mask Register is used to select the bits of the RXEV registers, whic */
#define USB_USB_M_RXFIFO31_MASK               (0x7 << 0) /* Same Bit Definition as RXEV Register */
#define USB_USB_M_RXFIFO31_POS                (0) /* Same Bit Definition as RXEV Register */

/* USB_RXS0 Register */

#define USB_USB_SETUP                         (1U << 13) /* Setup This bit indicates that the setup packet has been received. This bit is un */
#define USB_USB_TOGGLE_RX0                    (1U << 12) /* Toggle This bit specified the PID used when receiving the packet. A value of 0 i */
#define USB_USB_RX_LAST                       (1U << 11) /* Receive Last Bytes This bit indicates that an ACK was sent upon completion of a  */
#define USB_USB_RCOUNT_MASK                   (0x7FF << 0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */
#define USB_USB_RCOUNT_POS                    (0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */

/* USB_RXS1 Register */

#define USB_USB_RXFULL                        (1U << 15) /* Indicates that the RX fifo is full */
#define USB_USB_RX_ERR                        (1U << 14) /* Receive Error When set to 1, this bit indicates a media error, such as bit-stuff */
#define USB_USB_SETUP                         (1U << 13) /* Setup This bit indicates that the setup packet has been received. It is cleared  */
#define USB_USB_TOGGLE_RX                     (1U << 12) /* Toggle The function of this bit differs depending on whether ISO (ISO in the EPC */
#define USB_USB_RX_LAST                       (1U << 11) /* Receive Last This bit indicates that an ACK was sent upon completion of a succes */
#define USB_USB_RCOUNT_MASK                   (0x7FF << 0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */
#define USB_USB_RCOUNT_POS                    (0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */

/* USB_RXS2 Register */

