AlmAck/svdtonuttx/demo/h/da1470x_usb.h
#define USB_USB_RXFULL                        (1U << 15) /* Indicates that the RX fifo is full */
#define USB_USB_RX_ERR                        (1U << 14) /* Receive Error When set to 1, this bit indicates a media error, such as bit-stuff */
#define USB_USB_SETUP                         (1U << 13) /* Setup This bit indicates that the setup packet has been received. It is cleared  */
#define USB_USB_TOGGLE_RX                     (1U << 12) /* Toggle The function of this bit differs depending on whether ISO (ISO in the EPC */
#define USB_USB_RX_LAST                       (1U << 11) /* Receive Last This bit indicates that an ACK was sent upon completion of a succes */
#define USB_USB_RCOUNT_MASK                   (0x7FF << 0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */
#define USB_USB_RCOUNT_POS                    (0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */

/* USB_RXS3 Register */

#define USB_USB_RXFULL                        (1U << 15) /* Indicates that the RX fifo is full */
#define USB_USB_RX_ERR                        (1U << 14) /* Receive Error When set to 1, this bit indicates a media error, such as bit-stuff */
#define USB_USB_SETUP                         (1U << 13) /* Setup This bit indicates that the setup packet has been received. It is cleared  */
#define USB_USB_TOGGLE_RX                     (1U << 12) /* Toggle The function of this bit differs depending on whether ISO (ISO in the EPC */
#define USB_USB_RX_LAST                       (1U << 11) /* Receive Last This bit indicates that an ACK was sent upon completion of a succes */
#define USB_USB_RCOUNT_MASK                   (0x7FF << 0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */
#define USB_USB_RCOUNT_POS                    (0) /* Receive Count This field contains the number of bytes presently in the RX FIFO. */

/* USB_TCR Register */

#define USB_USB_VADJ_MASK                     (0x7 << 5) /* Reference Voltage/ Threshold voltage AdjustControls the single-ended receiver th */
#define USB_USB_VADJ_POS                      (5) /* Reference Voltage/ Threshold voltage AdjustControls the single-ended receiver th */
#define USB_USB_CADJ_MASK                     (0x1F << 0) /* Transmitter Current Adjust Controls the driver edge rate control current. Shall  */
#define USB_USB_CADJ_POS                      (0) /* Transmitter Current Adjust Controls the driver edge rate control current. Shall  */

/* USB_TXC0 Register */

#define USB_USB_IGN_IN                        (1U << 4) /* Ignore IN Tokens When this bit is set to 1, the endpoint will ignore any IN toke */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the control endpoint FI */
#define USB_USB_TOGGLE_TX0                    (1U << 2) /* Toggle This bit specifies the PID used when transmitting the packet. A value of  */
#define USB_USB_TX_EN                         (1U << 0) /* Transmission Enable This bit enables data transmission from the FIFO. It is clea */

/* USB_TXC1 Register */

#define USB_USB_IGN_ISOMSK                    (1U << 7) /* Ignore ISO Mask This bit has an effect only if the endpoint is set to be isochro */
#define USB_USB_TFWL_MASK                     (0x3 << 5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_TFWL_POS                      (5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_RFF                           (1U << 4) /* Refill FIFO Setting the LAST bit to 1 automatically saves the Transmit Read Poin */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding trans */
#define USB_USB_TOGGLE_TX                     (1U << 2) /* Toggle The function of this bit differs depending on whether ISO (ISO bit in the */
#define USB_USB_LAST                          (1U << 1) /* Last Byte Setting this bit to 1 indicates that the entire packet has been writte */
#define USB_USB_TX_EN                         (1U << 0) /* Transmission Enable This bit enables data transmission from the FIFO. It is clea */

/* USB_TXC2 Register */

#define USB_USB_IGN_ISOMSK                    (1U << 7) /* Ignore ISO Mask This bit has an effect only if the endpoint is set to be isochro */
#define USB_USB_TFWL_MASK                     (0x3 << 5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_TFWL_POS                      (5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_RFF                           (1U << 4) /* Refill FIFO Setting the LAST bit to 1 automatically saves the Transmit Read Poin */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding trans */
#define USB_USB_TOGGLE_TX                     (1U << 2) /* Toggle The function of this bit differs depending on whether ISO (ISO bit in the */
#define USB_USB_LAST                          (1U << 1) /* Last Byte Setting this bit to 1 indicates that the entire packet has been writte */
#define USB_USB_TX_EN                         (1U << 0) /* Transmission Enable This bit enables data transmission from the FIFO. It is clea */

/* USB_TXC3 Register */

#define USB_USB_IGN_ISOMSK                    (1U << 7) /* Ignore ISO Mask This bit has an effect only if the endpoint is set to be isochro */
#define USB_USB_TFWL_MASK                     (0x3 << 5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_TFWL_POS                      (5) /* Transmit FIFO Warning Limit These bits specify how many more bytes can be transm */
#define USB_USB_RFF                           (1U << 4) /* Refill FIFO Setting the LAST bit to 1 automatically saves the Transmit Read Poin */
#define USB_USB_FLUSH                         (1U << 3) /* Flush FIFO Writing a 1 to this bit flushes all data from the corresponding trans */
#define USB_USB_TOGGLE_TX                     (1U << 2) /* Toggle The function of this bit differs depending on whether ISO (ISO bit in the */
#define USB_USB_LAST                          (1U << 1) /* Last Byte Setting this bit to 1 indicates that the entire packet has been writte */
#define USB_USB_TX_EN                         (1U << 0) /* Transmission Enable This bit enables data transmission from the FIFO. It is clea */

/* USB_TXD0 Register */

#define USB_USB_TXFD_MASK                     (0xFF << 0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */
#define USB_USB_TXFD_POS                      (0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */

/* USB_TXD1 Register */

#define USB_USB_TXFD_MASK                     (0xFF << 0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */
#define USB_USB_TXFD_POS                      (0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */

/* USB_TXD2 Register */

#define USB_USB_TXFD_MASK                     (0xFF << 0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */
#define USB_USB_TXFD_POS                      (0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */

