AlmAck/svdtonuttx/demo/h/da1470x_usb.h
/* USB_TXD3 Register */

#define USB_USB_TXFD_MASK                     (0xFF << 0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */
#define USB_USB_TXFD_POS                      (0) /* Transmit FIFO Data Byte The firmware is expected to write only the packet payloa */

/* USB_TXEV Register */

#define USB_USB_TXUDRRN31_MASK                (0x7 << 4) /* Transmit Underrun n: 3:1 The bit n is a copy of the respective TX_URUN bit from  */
#define USB_USB_TXUDRRN31_POS                 (4) /* Transmit Underrun n: 3:1 The bit n is a copy of the respective TX_URUN bit from  */
#define USB_USB_TXFIFO31_MASK                 (0x7 << 0) /* Transmit FIFO n: 3:1 The bit n is a copy of the TX_DONE bit from the correspondi */
#define USB_USB_TXFIFO31_POS                  (0) /* Transmit FIFO n: 3:1 The bit n is a copy of the TX_DONE bit from the correspondi */

/* USB_TXMSK Register */

#define USB_USB_M_TXUDRRN31_MASK              (0x7 << 4) /* The Transmit Mask Register is used to select the bits of the TXEV registers, whi */
#define USB_USB_M_TXUDRRN31_POS               (4) /* The Transmit Mask Register is used to select the bits of the TXEV registers, whi */
#define USB_USB_M_TXFIFO31_MASK               (0x7 << 0) /* Same Bit Definition as TXEV Register */
#define USB_USB_M_TXFIFO31_POS                (0) /* Same Bit Definition as TXEV Register */

/* USB_TXS0 Register */

#define USB_USB_ACK_STAT                      (1U << 12) /* Acknowledge Status This bit indicates the status, as received from the host, of  */
#define USB_USB_TX_DONE                       (1U << 11) /* Transmission Done When set to 1, this bit indicates that a packet has completed  */
#define USB_USB_TCOUNT_MASK                   (0x7FF << 0) /* Transmission Count This field indicates the number of empty bytes available in t */
#define USB_USB_TCOUNT_POS                    (0) /* Transmission Count This field indicates the number of empty bytes available in t */

/* USB_TXS1 Register */

#define USB_USB_TX_URUN                       (1U << 13) /* Transmit FIFO Underrun This bit is set to 1, if the transmit FIFO becomes empty  */
#define USB_USB_ACK_STAT                      (1U << 12) /* Acknowledge Status This bit is interpreted when TX_DONE is set. It's function di */
#define USB_USB_TX_DONE                       (1U << 11) /* Transmission Done When set to 1, this bit indicates that the endpoint responded  */
#define USB_USB_TCOUNT_MASK                   (0x7FF << 0) /* Transmission Count This field indicates the number of empty bytes available in t */
#define USB_USB_TCOUNT_POS                    (0) /* Transmission Count This field indicates the number of empty bytes available in t */

/* USB_TXS2 Register */

#define USB_USB_TX_URUN                       (1U << 13) /* Transmit FIFO Underrun This bit is set to 1, if the transmit FIFO becomes empty  */
#define USB_USB_ACK_STAT                      (1U << 12) /* Acknowledge Status This bit is interpreted when TX_DONE is set. It's function di */
#define USB_USB_TX_DONE                       (1U << 11) /* Transmission Done When set to 1, this bit indicates that the endpoint responded  */
#define USB_USB_TCOUNT_MASK                   (0x7FF << 0) /* Transmission Count This field indicates the number of empty bytes available in t */
#define USB_USB_TCOUNT_POS                    (0) /* Transmission Count This field indicates the number of empty bytes available in t */

/* USB_TXS3 Register */

#define USB_USB_TX_URUN                       (1U << 13) /* Transmit FIFO Underrun This bit is set to 1, if the transmit FIFO becomes empty  */
#define USB_USB_ACK_STAT                      (1U << 12) /* Acknowledge Status This bit is interpreted when TX_DONE is set. It's function di */
#define USB_USB_TX_DONE                       (1U << 11) /* Transmission Done When set to 1, this bit indicates that the endpoint responded  */
#define USB_USB_TCOUNT_MASK                   (0x7FF << 0) /* Transmission Count This field indicates the number of empty bytes available in t */
#define USB_USB_TCOUNT_POS                    (0) /* Transmission Count This field indicates the number of empty bytes available in t */

/* USB_UTR Register */

#define USB_USB_DIAG                          (1U << 7) /* Diagnostic enable 0: Normal operational. 1: Access to the USB_XCVDIAG_REG and US */
#define USB_USB_NCRC                          (1U << 6) /* No CRC16 When this bit is set to 1, all packets transmitted by the Full/Low Spee */
#define USB_USB_SF                            (1U << 5) /* Short Frame Enables the Frame timer to lock and track, short, non-compliant USB  */
#define USB_USB_UTR_RES_MASK                  (0x1F << 0) /* Reserved. Must be kept to 0 */
#define USB_USB_UTR_RES_POS                   (0) /* Reserved. Must be kept to 0 */

/* USB_UX20CDR Register */

#define USB_RPU_TEST7                         (1U << 7) /* Test bit */
#define USB_RPU_TEST_SW2                      (1U << 6) /* 0: Closes SW2 switch to reduced pull-up resistor connected to the USB_Dp and USB */
#define USB_RPU_TEST_SW1                      (1U << 5) /* 0: Enable the pull-up resistor on USB_Dp (SW1 closed) 1: Disable the pull-up res */
#define USB_RPU_TEST_EN                       (1U << 4) /* Pull-Up Resistor Test Enable 0: Normal operation 1: Enables the test features co */
#define USB_RPU_TEST_SW1DM                    (1U << 2) /* 0: Enable the pull-up resistor on USB_Dm (SW1DM closed) 1: Disable the pull-up r */
#define USB_RPU_RCDELAY                       (1U << 1) /* Test bit, must be kept 0 */
#define USB_RPU_SSPROTEN                      (1U << 0) /* Test bit, must be kept 0 */

/* USB_XCVDIAG Register */

#define USB_USB_VPIN                          (1U << 7) /* With Bit0 = 1 this bit shows the level of the USB_Dp receive data from transceiv */
#define USB_USB_VMIN                          (1U << 6) /* With Bit0 = 1 this bit shows the level USB_Dm receive data from transceiver; D-  */
#define USB_USB_RCV                           (1U << 5) /* With Bit0 = 1 this bit shows the differential level of the receive comparator. */
#define USB_USB_XCV_TXEN                      (1U << 3) /* With Bit0 = 1, this bit enables test Bits 2,1. Must be kept to 0 for normal oper */
#define USB_USB_XCV_TXn                       (1U << 2) /* With Bit3,0 = 1, this bit sets USB_Dm to a high level, independent of LSMODE sel */
#define USB_USB_XCV_TXp                       (1U << 1) /* With Bit3,0 = 1, this bit sets USB_Dp to a high level, independent of LSMODE sel */
#define USB_USB_XCV_TEST                      (1U << 0) /* Enable USB_XCVDIAG_REG 0: Normal operation, test bits disabled 1: Enable test bi */

#endif /* __DA1470X_USB_H */
